'''
input_quiz02.

이름을 입력하세요
나이를 입력하세요
-------------------------------------------------
이름: 홍길동
나이: 29
-------------------------------------------------
*** 회원정보 ***
이름: 홍길동
나이: 29세
출생년도: 1991 년생
'''

nickname = input("이름: ")
age = input("나이: ")
print ("""*** 회원정보 ***
이름: 홍길동
나이: 29세
출생년도: 1991 년생""")

name = input("이름을 입력하세요: ")
age = int(input("나이를 입력하세요 "))
birthyear = 2019 - age + 1
print("----------------------------------------")
print("*** 회원정보 ***")
print("이름:",name)
print("나이:",age,"세" )
print("출생년도:",birthyear,"년생")


print("----------------------------------------")
print("*** 회원정보 ***")
print("이름:",name,"\n","나이:",age,"\n","출생년도:",birthyear,"년생")