
'''
* 주석문 (comments)

- 주석은 프로그램의 실행에는 전혀 영향을 주지 않습니다.
- 코드를 작성한 후에 그 코드를 이해하기 쉽도록 코드에 설명을
 첨언하는 기능입니다.
- 코드에 주석을 달면 프로그램을 수정하거나 변경할 때
 시간과 노력을 절감할 수 있습니다.
'''

# 이 소스코드는 주석을 공부하는 모듈파일입니다.
# 한 줄만 주석처리를 할 때는 # 기호를 쓰고 뒤에 내용을 작성합니다.

# Ctrl + F11 = 실행 단축키.
print("hello python!!!")
# print("안녕안녕") # Ctrl + / : 빠른 주석처리.
print("메롱메롱") # 샵 오른쪽만 주석으로 간주합니다.

# 파이썬에서는 문장의 끝에 세미콜론을 붙이지 않아도 됩니다.
# 단, 한 줄에 여러 문장을 작성할 때는 세미콜론을 사용합니다.
print(3 * 7); print(2 + 3);

# 파이썬에서는 불필요한 들여쓰기를 허용하지 않습니다.
# print("야호~~~") (x)

# 파이썬의 모든 명령은 대 / 소문자를 구분합니다.
print("안녕하세요!")
# PRINT("안녕~") (x)

print(4 * 5)










